OpenFOAM/test/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    FrontAndBack
    {
        type            empty;
    }
    patch1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    patch2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    patch3
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Shaft
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Inlet
    {
        type            freestream;
        freestreamValue uniform (-5 0 0);
        value           uniform (-5 0 0);
    }
    Lat-Wall
    {
        type            fixedValue;
        value           uniform (-5 0 0);
    }
    Outlet
    {
        type		inletOutlet;
        inletValue	uniform (-5 0 0);
        value           uniform (-5 0 0);
    }
    AMI-St
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    AMI-Rt
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
