OpenFOAM/test/system/baffleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    baffleFaces
    {
        type		faceZone;
        zoneName	AMI-Rt;
    	flip		true;
	
        patches
        {
            master
            {
                name            AMI-St;
                type            cyclicAMI;
            }
            slave
	    { 
			name	AMI-Rt;
			type	cyclicAMI;
	    }
        }
    }
}

// ************************************************************************* // 

